 [
    {
      "title": "Retro Skull",
      "price": 24.99,
      "description": "Channel the timeless rebellion of rock 'n' roll with this vintage-inspired design. Featuring a smoking skull against a classic sunset backdrop, it's the perfect tee for those who live by their own rules. A must-have for any true rock enthusiast.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd1.png",
      "ratingRate": 4.7,
      "ratingCount": 350
    },
    {
      "title": "Stage Shredder",
      "price": 19.99,
      "description": "Capture the raw energy of a live performance with this striking black and white design. A lone guitarist shreds under the stage lights, embodying the soul of hard rock. Wear the passion, feel the music.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd2.png",
      "ratingRate": 4.5,
      "ratingCount": 420
    },
    {
      "title": "Winged King",
      "price": 27.5,
      "description": "Rule the scene with the 'Winged King' tee. This intricate design showcases a crowned skull, flanked by powerful wings and banners, symbolizing rock royalty. A majestic and bold statement piece.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd3.png",
      "ratingRate": 4.8,
      "ratingCount": 280
    },
    {
      "title": "Metal Menace",
      "price": 22.95,
      "description": "Unleash your inner beast with this ferocious design. The menacing skull with piercing red eyes and daggers clenched in its teeth screams pure metal intensity. Not for the faint of heart.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd4.png",
      "ratingRate": 4.6,
      "ratingCount": 155
    },
    {
      "title": "Boneyard Blues",
      "price": 25,
      "description": "Even in the afterlife, the music never stops. This tee features a skeletal rocker laying down a gritty riff on his trusty guitar. It's a tribute to the undying spirit of rock.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd5.png",
      "ratingRate": 4.4,
      "ratingCount": 310
    },
    {
      "title": "Rebel Icon",
      "price": 18.99,
      "description": "Embrace the authentic, raw aesthetic of rock history. This shirt features a powerful, photo-realistic portrait of a rock icon, capturing a moment of quiet intensity. A classic look for any music aficionado.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd6.png",
      "ratingRate": 4.2,
      "ratingCount": 98
    },
    {
      "title": "Smokey Rebel",
      "price": 26.5,
      "description": "A fusion of rebellion and raw power. This design features a defiant, smoking skull with intricate details and a cool, hazy backdrop. It's the perfect shirt for those who walk their own path.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd7.png",
      "ratingRate": 4.9,
      "ratingCount": 480
    },
    {
      "title": "Canyon Rocker",
      "price": 23,
      "description": "Rock out with a touch of outlaw style. This tee depicts a cool-as-bone guitarist in a hat and shades, strumming against a rugged landscape. For the musician with a mysterious edge.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd8.png",
      "ratingRate": 4.3,
      "ratingCount": 225
    },
    {
      "title": "Undead Tour",
      "price": 29.99,
      "description": "The band is back from the grave for one more tour. This vibrant tee showcases a full skeleton band rocking out against a retro-colored background. A perfect design for fans of classic metal and horror.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd9.png",
      "ratingRate": 4.8,
      "ratingCount": 190
    },
    {
      "title": "Grim Warrior",
      "price": 21.9,
      "description": "Prepare for battle with this epic 'Grim Warrior' t-shirt. A hooded reaper, armed with crossed swords, stands ready for anything. It's a powerful symbol of strength and defiance.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd10.png",
      "ratingRate": 4.6,
      "ratingCount": 390
    },
    {
      "title": "Retro Undead",
      "price": 29.99,
      "description": "Rock never dies, it just gets more metal. This tee features a skeletal frontman shredding on his bass, backed by his undead bandmates and a vintage sunset. It's a killer look for any concert or night out.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd11.png",
      "ratingRate": 4.7,
      "ratingCount": 210
    },
    {
      "title": "Punk Rocker",
      "price": 20.5,
      "description": "Capture the gritty spirit of the underground scene. This tee showcases a stark, powerful portrait of a rocker with a defiant gaze and punk-inspired gear. A tribute to the raw, untamed energy of rock 'n' roll.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd12.png",
      "ratingRate": 3.9,
      "ratingCount": 75
    },
    {
      "title": "Fiery Skull All-Over",
      "price": 28.99,
      "description": "Unleash your inner metalhead with this intense all-over print t-shirt. Featuring a central skull engulfed in vibrant orange and blue flames, this shirt is a bold statement. The detailed graphics cover the entire front and sleeves, ensuring you stand out in any crowd.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm1.png",
      "ratingRate": 4.6,
      "ratingCount": 258
    },
    {
      "title": "Lightning Band Tee",
      "price": 24.95,
      "description": "Pay homage to the legends of metal with this classic-fit t-shirt. The iconic 'Heavy Metal' logo crackles with lightning energy above a portrait of the genre's pioneers. It's the perfect tee for concerts, festivals, or just showing off your impeccable taste in music.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm2.png",
      "ratingRate": 4.8,
      "ratingCount": 412
    },
    {
      "title": "Skull Pile Inferno",
      "price": 29.99,
      "description": "Dive into the abyss with this menacing skull-themed t-shirt. An intricate design of multiple skulls and sharp spikes covers the front and sleeves, set against a backdrop of smoldering embers. This is a must-have for those who prefer their style on the darker side.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm3.png",
      "ratingRate": 4.4,
      "ratingCount": 189
    },
    {
      "title": "Dragon Skull Crest",
      "price": 22.5,
      "description": "Summon the power of ancient beasts with this epic t-shirt. A fearsome skull is flanked by two majestic dragons, all set against a fiery pit of skulls. This powerful crest design is perfect for fans of fantasy and heavy metal.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm4.png",
      "ratingRate": 4.7,
      "ratingCount": 333
    },
    {
      "title": "Undead Army",
      "price": 21.99,
      "description": "Lead the charge of the damned with this grim and detailed t-shirt. The monochromatic artwork depicts a skeletal general and his undead army, creating a dark and atmospheric piece. The high-contrast design is both striking and sophisticated.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm5.png",
      "ratingRate": 4.3,
      "ratingCount": 215
    },
    {
      "title": "Night Of The Great",
      "price": 23,
      "description": "Commemorate a legendary event with the 'Night Of The Great' tee. This unique dark teal shirt features a complex collage of metal warriors, demonic figures, and skulls. It's a wearable piece of art that tells a story of an epic battle.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm6.png",
      "ratingRate": 4.5,
      "ratingCount": 98
    },
    {
      "title": "Purple Wolf Howl",
      "price": 27.95,
      "description": "Answer the call of the wild with this vibrant purple and black all-over print. A ferocious wolf howls amidst a tangled, thorny forest, with a sharp, metallic logo above. This unique color scheme brings a fresh twist to classic metal imagery.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm7.png",
      "ratingRate": 4.9,
      "ratingCount": 350
    },
    {
      "title": "Holy Metal Jam",
      "price": 25.5,
      "description": "Join the eternal jam session with this 'Holy Metal' t-shirt. Featuring a band of skeletons rocking out in a fiery underworld, this design is pure, unadulterated fun. The striking orange-to-teal gradient makes the artwork pop.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm8.png",
      "ratingRate": 4.7,
      "ratingCount": 155
    },
    {
      "title": "Chaotic Demon Lord",
      "price": 24.99,
      "description": "Embrace the chaos with this incredibly detailed graphic tee. A powerful demon lord stands triumphant amidst a battlefield of twisted creatures, rendered in a classic comic book art style. The vibrant blue and yellow colors make this complex design stand out.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm9.png",
      "ratingRate": 4.8,
      "ratingCount": 480
    },
    {
      "title": "Cyber Skull Flame",
      "price": 29.99,
      "description": "Fuse metal with machine in this high-octane t-shirt. A menacing skull with glowing eyes is framed by roaring flames and intricate cybernetic details. The all-over print creates a powerful and dynamic look from every angle.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm10.png",
      "ratingRate": 4.6,
      "ratingCount": 299
    },
    {
      "title": "Funk Magazine Tee",
      "price": 24.99,
      "description": "Channel the golden age of funk with this vintage-inspired tee. The design, reminiscent of a classic music magazine cover, features an eclectic group of funk artists in vibrant colors. Perfect for music lovers and retro style enthusiasts.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f1.png",
      "ratingRate": 4.5,
      "ratingCount": 250
    },
    {
      "title": "Teal Funk Legends",
      "price": 22.5,
      "description": "Stand out in this cool teal tee celebrating the legends of funk. The graphic showcases a funky quartet with afros and vintage gear, set against a dynamic, colorful backdrop. A must-have for anyone who loves the groove.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f2.png",
      "ratingRate": 4.2,
      "ratingCount": 180
    },
    {
      "title": "Red Funk Trio",
      "price": 19.95,
      "description": "Ignite your style with this bold red funk t-shirt. Featuring a trio of musicians ready to lay down a groove, this tee pops with vibrant energy. The rolled sleeves add a casual, cool touch to this retro-inspired piece.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f3.png",
      "ratingRate": 4.7,
      "ratingCount": 310
    },
    {
      "title": "Cream Funk Band",
      "price": 25,
      "description": "Get down with the sound in this stylish cream-colored t-shirt. The graphic captures a full funk band in action, complete with a drummer, guitarists, and an unmistakable '70s vibe. It's a wearable piece of music history.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f4.png",
      "ratingRate": 4.1,
      "ratingCount": 125
    },
    {
      "title": "Navy Funk Collage",
      "price": 27.9,
      "description": "Dive deep into the funk scene with this navy blue tee. The detailed collage graphic is packed with charismatic musicians, vibrant colors, and that classic funk energy. A timeless piece for any wardrobe.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f5.png",
      "ratingRate": 4.8,
      "ratingCount": 450
    },
    {
      "title": "Groovy Funk Crew",
      "price": 21.99,
      "description": "Embrace the rhythm with this cool teal-green funk t-shirt. The design features a classic funk band posed around their drum kit, with retro typography adding to the authentic feel. It's the perfect shirt for feeling the beat.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f6.png",
      "ratingRate": 3.9,
      "ratingCount": 98
    },
    {
      "title": "Mustard Funk Collective",
      "price": 23.5,
      "description": "Add some flavor to your look with this unique mustard yellow funk tee. The busy, collage-style graphic celebrates the faces and fashion of the funk era. It's a conversation starter and a tribute to a legendary genre.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f7.png",
      "ratingRate": 4.3,
      "ratingCount": 215
    },
    {
      "title": "Funk Back Print",
      "price": 26,
      "description": "Business in the front, party in the back! This cream-colored tee features a large, dynamic funk magazine-style print on the back. Show off your love for the groove from every angle.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f8.png",
      "ratingRate": 4.6,
      "ratingCount": 155
    },
    {
      "title": "Funky Black Tee",
      "price": 18.99,
      "description": "Keep it classic and cool with this black 'Funk Funky' t-shirt. The detailed graphic showcases a full band setup, blending Afrofuturist elements with classic '70s style. A versatile and stylish addition to any music fan's collection.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f9.png",
      "ratingRate": 4.9,
      "ratingCount": 480
    },
    {
      "title": "Funky Style Tee",
      "price": 24.95,
      "description": "This cream tee is all about 'Funk Style'. Featuring a vibrant, star-studded graphic of a funk ensemble, it's the perfect way to pay homage to the icons of the genre. The design is bold, colorful, and full of energy.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f10.png",
      "ratingRate": 4.4,
      "ratingCount": 333
    },
    {
      "title": "Unisex Funk Trio",
      "price": 20,
      "description": "Funk is for everyone! This crisp white unisex tee features a stylish trio of funk musicians. With its clean design and classic fit, it's a versatile piece that looks great on anyone ready to get down.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f11.png",
      "ratingRate": 4,
      "ratingCount": 289
    },
    {
      "title": "Heavy Funk Vibe",
      "price": 29.99,
      "description": "Bring the 'Heavy Funk' with this navy blue tee. The design features a cool trio against a sunset and palm trees, blending a laid-back vibe with powerful funk style. It's perfect for warm days and funky nights.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f12.png",
      "ratingRate": 4.7,
      "ratingCount": 390
    },
    {
      "title": "Retro Rock Poster",
      "price": 24.99,
      "description": "Showcase your love for vintage rock posters with this detailed graphic tee. The dark navy fabric provides the perfect canvas for the intricate, colorful artwork, making it a standout piece for any music lover's wardrobe. It's soft, comfortable, and full of character.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a1.png",
      "ratingRate": 4.6,
      "ratingCount": 210
    },
    {
      "title": "Fantasy Art Tee",
      "price": 22.5,
      "description": "Dive into a world of fantasy with this incredible graphic tee. The beige shirt features a sprawling, detailed illustration reminiscent of classic fantasy art and rock album covers. A true conversation starter for those who appreciate unique designs.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a2.png",
      "ratingRate": 4.8,
      "ratingCount": 155
    },
    {
      "title": "Tropic Rock Tee",
      "price": 25.95,
      "description": "Rock out in paradise with this unique tee. Combining classic rock imagery with tropical palm trees, this shirt offers a fresh, unexpected twist. The deep teal color makes the vibrant graphic pop, perfect for concerts or beach bonfires.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a3.png",
      "ratingRate": 4.5,
      "ratingCount": 88
    },
    {
      "title": "Skull Backprint Tee",
      "price": 21.99,
      "description": "Make an exit as memorable as your entrance. This light aqua tee features a bold skull and bones graphic on the back, perfect for those who prefer a more subtle statement from the front. The soft cotton and relaxed fit ensure all-day comfort.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a4.png",
      "ratingRate": 4.2,
      "ratingCount": 120
    },
    {
      "title": "Angelic Rocker Tee",
      "price": 26.5,
      "description": "Unleash your inner rock angel with this epic graphic t-shirt. Featuring a powerful central figure with wings, surrounded by a collage of edgy designs, this navy tee is a masterpiece of alternative style. It's perfect for making a bold statement.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a5.png",
      "ratingRate": 4.9,
      "ratingCount": 342
    },
    {
      "title": "Dark Folk Tee",
      "price": 23,
      "description": "Embrace a darker, more mystical vibe with this intriguing graphic tee. The design, centered on a haunting figure, evokes a sense of folk horror and alternative rock lore. Printed on a classic navy shirt, it's both stylish and enigmatic.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a6.png",
      "ratingRate": 4.4,
      "ratingCount": 95
    },
    {
      "title": "Gradient Sci-Fi Tee",
      "price": 28.99,
      "description": "Travel to another dimension with this eye-catching t-shirt. The stunning pink-to-blue gradient is the perfect backdrop for a retro sci-fi comic book scene, complete with a guitar-wielding hero. A vibrant and unique addition to any collection.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a7.png",
      "ratingRate": 4.7,
      "ratingCount": 250
    },
    {
      "title": "Psychedelic Pop Tee",
      "price": 24,
      "description": "Stand out from the crowd in this wildly colorful and imaginative tee. The design is a chaotic, beautiful explosion of pop art and psychedelic imagery, printed on a cool slate blue fabric. It's a wearable piece of art for the bold and adventurous.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a8.png",
      "ratingRate": 4.3,
      "ratingCount": 180
    },
    {
      "title": "Mint Skull Collage",
      "price": 22.95,
      "description": "A cool and refreshing take on alternative style. This mint green tee features a vertical panel graphic, filled with a collage of eclectic characters and a prominent skull. The unique layout and color make it a modern classic.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a9.png",
      "ratingRate": 4.1,
      "ratingCount": 75
    },
    {
      "title": "Arachnid Warrior Tee",
      "price": 27.5,
      "description": "Face your fears in style with this intense graphic tee. A formidable warrior skull, entangled with a giant spider, takes center stage on this dark navy shirt. It's a powerful and detailed design for fans of dark fantasy and metal aesthetics.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a10.png",
      "ratingRate": 4.8,
      "ratingCount": 410
    },
    {
      "title": "Classic Band Tee",
      "price": 19.99,
      "description": "Capture the timeless look of a classic rock band with this effortlessly cool t-shirt. Featuring a black-and-white photo of a three-piece band against a colorful, spray-painted background, this black tee is an essential for any rock fan's wardrobe.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a11.png",
      "ratingRate": 5,
      "ratingCount": 489
    },
    {
      "title": "Rock Trio Tee",
      "price": 19.99,
      "description": "A slightly different angle on a classic. This black tee showcases a cool rock trio with a vibrant, colorful splash effect. It has a vintage feel with a modern edge, perfect for concerts, casual outings, or just showing off your great taste in music.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a12.png",
      "ratingRate": 4.9,
      "ratingCount": 321
    },
    {
      "title": "Tie-Dye Rock Tee",
      "price": 29.95,
      "description": "Combine the best of two worlds with this tie-dye rock tee. The vibrant purple, orange, and blue tie-dye pattern provides a psychedelic backdrop for a classic black-and-white band graphic. Featuring a contrasting black ringer collar, this shirt is pure festival energy.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a13.png",
      "ratingRate": 4.7,
      "ratingCount": 298
    },
    {
      "title": "Smoking Skull Classic",
      "price": 18.55,
      "description": "Channel the timeless rebellion of rock 'n' roll with this vintage-inspired design. Featuring a smoking skull against a classic sunset backdrop, it's the perfect tee for those who live by their own rules. A must-have for any true rock enthusiast.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd1.png",
      "ratingRate": 4.2,
      "ratingCount": 295
    },
    {
      "title": "Guitar Soloist",
      "price": 28.95,
      "description": "Capture the raw energy of a live performance with this striking black and white design. A lone guitarist shreds under the stage lights, embodying the soul of hard rock. Wear the passion, feel the music.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd2.png",
      "ratingRate": 4.9,
      "ratingCount": 315
    },
    {
      "title": "Crowned Skull",
      "price": 17.99,
      "description": "Rule the scene with the 'Winged King' tee. This intricate design showcases a crowned skull, flanked by powerful wings and banners, symbolizing rock royalty. A majestic and bold statement piece.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd3.png",
      "ratingRate": 4.1,
      "ratingCount": 455
    },
    {
      "title": "Red-Eyed Skull",
      "price": 14.5,
      "description": "Unleash your inner beast with this ferocious design. The menacing skull with piercing red eyes and daggers clenched in its teeth screams pure metal intensity. Not for the faint of heart.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd4.png",
      "ratingRate": 4.1,
      "ratingCount": 255
    },
    {
      "title": "Skeletal Riff",
      "price": 16.75,
      "description": "Even in the afterlife, the music never stops. This tee features a skeletal rocker laying down a gritty riff on his trusty guitar. It's a tribute to the undying spirit of rock.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd5.png",
      "ratingRate": 3.8,
      "ratingCount": 410
    },
    {
      "title": "Iconic Portrait",
      "price": 24.5,
      "description": "Embrace the authentic, raw aesthetic of rock history. This shirt features a powerful, photo-realistic portrait of a rock icon, capturing a moment of quiet intensity. A classic look for any music aficionado.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd6.png",
      "ratingRate": 4.8,
      "ratingCount": 150
    },
    {
      "title": "Defiant Skull",
      "price": 19.5,
      "description": "A fusion of rebellion and raw power. This design features a defiant, smoking skull with intricate details and a cool, hazy backdrop. It's the perfect shirt for those who walk their own path.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd7.png",
      "ratingRate": 4.4,
      "ratingCount": 380
    },
    {
      "title": "Outlaw Guitarist",
      "price": 28,
      "description": "Rock out with a touch of outlaw style. This tee depicts a cool-as-bone guitarist in a hat and shades, strumming against a rugged landscape. For the musician with a mysterious edge.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd8.png",
      "ratingRate": 4,
      "ratingCount": 325
    },
    {
      "title": "Skeleton Band",
      "price": 19.95,
      "description": "The band is back from the grave for one more tour. This vibrant tee showcases a full skeleton band rocking out against a retro-colored background. A perfect design for fans of classic metal and horror.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd9.png",
      "ratingRate": 4.2,
      "ratingCount": 290
    },
    {
      "title": "Reaper Blade",
      "price": 26.9,
      "description": "Prepare for battle with this epic 'Grim Warrior' t-shirt. A hooded reaper, armed with crossed swords, stands ready for anything. It's a powerful symbol of strength and defiance.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd10.png",
      "ratingRate": 4.9,
      "ratingCount": 290
    },
    {
      "title": "Undead Bassist",
      "price": 21.99,
      "description": "Rock never dies, it just gets more metal. This tee features a skeletal frontman shredding on his bass, backed by his undead bandmates and a vintage sunset. It's a killer look for any concert or night out.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd11.png",
      "ratingRate": 4.3,
      "ratingCount": 310
    },
    {
      "title": "Gritty Portrait",
      "price": 29.5,
      "description": "Capture the gritty spirit of the underground scene. This tee showcases a stark, powerful portrait of a rocker with a defiant gaze and punk-inspired gear. A tribute to the raw, untamed energy of rock 'n' roll.",
      "categoryId": "e6e2e03e-4fa1-415f-ae21-b919b650a384",
      "image": "assets/images/hard_rock/hd12.png",
      "ratingRate": 4.1,
      "ratingCount": 175
    },
    {
      "title": "Blazing Skull Design",
      "price": 20.99,
      "description": "Unleash your inner metalhead with this intense all-over print t-shirt. Featuring a central skull engulfed in vibrant orange and blue flames, this shirt is a bold statement. The detailed graphics cover the entire front and sleeves, ensuring you stand out in any crowd.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm1.png",
      "ratingRate": 4.1,
      "ratingCount": 358
    },
    {
      "title": "Heavy Metal Legends",
      "price": 18.95,
      "description": "Pay homage to the legends of metal with this classic-fit t-shirt. The iconic 'Heavy Metal' logo crackles with lightning energy above a portrait of the genre's pioneers. It's the perfect tee for concerts, festivals, or just showing off your impeccable taste in music.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm2.png",
      "ratingRate": 4.3,
      "ratingCount": 312
    },
    {
      "title": "Spiked Skull Tee",
      "price": 21.5,
      "description": "Dive into the abyss with this menacing skull-themed t-shirt. An intricate design of multiple skulls and sharp spikes covers the front and sleeves, set against a backdrop of smoldering embers. This is a must-have for those who prefer their style on the darker side.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm3.png",
      "ratingRate": 4.8,
      "ratingCount": 289
    },
    {
      "title": "Ancient Dragon Tee",
      "price": 28.5,
      "description": "Summon the power of ancient beasts with this epic t-shirt. A fearsome skull is flanked by two majestic dragons, all set against a fiery pit of skulls. This powerful crest design is perfect for fans of fantasy and heavy metal.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm4.png",
      "ratingRate": 4.2,
      "ratingCount": 433
    },
    {
      "title": "Skeletal General",
      "price": 15.99,
      "description": "Lead the charge of the damned with this grim and detailed t-shirt. The monochromatic artwork depicts a skeletal general and his undead army, creating a dark and atmospheric piece. The high-contrast design is both striking and sophisticated.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm5.png",
      "ratingRate": 4.8,
      "ratingCount": 115
    },
    {
      "title": "Epic Battle Tee",
      "price": 29,
      "description": "Commemorate a legendary event with the 'Night Of The Great' tee. This unique dark teal shirt features a complex collage of metal warriors, demonic figures, and skulls. It's a wearable piece of art that tells a story of an epic battle.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm6.png",
      "ratingRate": 4.1,
      "ratingCount": 198
    },
    {
      "title": "Wild Wolf Tee",
      "price": 19.95,
      "description": "Answer the call of the wild with this vibrant purple and black all-over print. A ferocious wolf howls amidst a tangled, thorny forest, with a sharp, metallic logo above. This unique color scheme brings a fresh twist to classic metal imagery.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm7.png",
      "ratingRate": 4.2,
      "ratingCount": 450
    },
    {
      "title": "Eternal Jam",
      "price": 18.5,
      "description": "Join the eternal jam session with this 'Holy Metal' t-shirt. Featuring a band of skeletons rocking out in a fiery underworld, this design is pure, unadulterated fun. The striking orange-to-teal gradient makes the artwork pop.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm8.png",
      "ratingRate": 4.1,
      "ratingCount": 255
    },
    {
      "title": "Demon Lord Comic",
      "price": 28.99,
      "description": "Embrace the chaos with this incredibly detailed graphic tee. A powerful demon lord stands triumphant amidst a battlefield of twisted creatures, rendered in a classic comic book art style. The vibrant blue and yellow colors make this complex design stand out.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm9.png",
      "ratingRate": 4.2,
      "ratingCount": 380
    },
    {
      "title": "Mechanic Skull",
      "price": 23.99,
      "description": "Fuse metal with machine in this high-octane t-shirt. A menacing skull with glowing eyes is framed by roaring flames and intricate cybernetic details. The all-over print creates a powerful and dynamic look from every angle.",
      "categoryId": "898622e8-0c0a-4841-a9e3-6844a9a4f082",
      "image": "assets/images/heavy_metal/hm10.png",
      "ratingRate": 4.9,
      "ratingCount": 199
    },
    {
      "title": "Vintage Funk Cover",
      "price": 18.99,
      "description": "Channel the golden age of funk with this vintage-inspired tee. The design, reminiscent of a classic music magazine cover, features an eclectic group of funk artists in vibrant colors. Perfect for music lovers and retro style enthusiasts.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f1.png",
      "ratingRate": 4.8,
      "ratingCount": 150
    },
    {
      "title": "Groovy Quartet",
      "price": 28.5,
      "description": "Stand out in this cool teal tee celebrating the legends of funk. The graphic showcases a funky quartet with afros and vintage gear, set against a dynamic, colorful backdrop. A must-have for anyone who loves the groove.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f2.png",
      "ratingRate": 4.9,
      "ratingCount": 280
    },
    {
      "title": "Groovy Musicians",
      "price": 26.95,
      "description": "Ignite your style with this bold red funk t-shirt. Featuring a trio of musicians ready to lay down a groove, this tee pops with vibrant energy. The rolled sleeves add a casual, cool touch to this retro-inspired piece.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f3.png",
      "ratingRate": 4.1,
      "ratingCount": 410
    },
    {
      "title": "Vintage Funk Band",
      "price": 17,
      "description": "Get down with the sound in this stylish cream-colored t-shirt. The graphic captures a full funk band in action, complete with a drummer, guitarists, and an unmistakable '70s vibe. It's a wearable piece of music history.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f4.png",
      "ratingRate": 4.7,
      "ratingCount": 225
    },
    {
      "title": "Funk Energy Tee",
      "price": 19.9,
      "description": "Dive deep into the funk scene with this navy blue tee. The detailed collage graphic is packed with charismatic musicians, vibrant colors, and that classic funk energy. A timeless piece for any wardrobe.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f5.png",
      "ratingRate": 4.3,
      "ratingCount": 350
    },
    {
      "title": "Rhythm Section Tee",
      "price": 28.99,
      "description": "Embrace the rhythm with this cool teal-green funk t-shirt. The design features a classic funk band posed around their drum kit, with retro typography adding to the authentic feel. It's the perfect shirt for feeling the beat.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f6.png",
      "ratingRate": 4.4,
      "ratingCount": 198
    },
    {
      "title": "Yellow Funk Tee",
      "price": 17.5,
      "description": "Add some flavor to your look with this unique mustard yellow funk tee. The busy, collage-style graphic celebrates the faces and fashion of the funk era. It's a conversation starter and a tribute to a legendary genre.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f7.png",
      "ratingRate": 4.8,
      "ratingCount": 115
    },
    {
      "title": "Cream Funk Print",
      "price": 16.5,
      "description": "Business in the front, party in the back! This cream-colored tee features a large, dynamic funk magazine-style print on the back. Show off your love for the groove from every angle.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f8.png",
      "ratingRate": 4,
      "ratingCount": 255
    },
    {
      "title": "Afrofuture Funk",
      "price": 25.99,
      "description": "Keep it classic and cool with this black 'Funk Funky' t-shirt. The detailed graphic showcases a full band setup, blending Afrofuturist elements with classic '70s style. A versatile and stylish addition to any music fan's collection.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f9.png",
      "ratingRate": 4.2,
      "ratingCount": 380
    },
    {
      "title": "Star-Studded Funk",
      "price": 16.95,
      "description": "This cream tee is all about 'Funk Style'. Featuring a vibrant, star-studded graphic of a funk ensemble, it's the perfect way to pay homage to the icons of the genre. The design is bold, colorful, and full of energy.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f10.png",
      "ratingRate": 4.9,
      "ratingCount": 233
    },
    {
      "title": "White Funk Tee",
      "price": 28,
      "description": "Funk is for everyone! This crisp white unisex tee features a stylish trio of funk musicians. With its clean design and classic fit, it's a versatile piece that looks great on anyone ready to get down.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f11.png",
      "ratingRate": 4.5,
      "ratingCount": 189
    },
    {
      "title": "Sunset Funk Tee",
      "price": 21.95,
      "description": "Bring the 'Heavy Funk' with this navy blue tee. The design features a cool trio against a sunset and palm trees, blending a laid-back vibe with powerful funk style. It's perfect for warm days and funky nights.",
      "categoryId": "d9565c78-8d6d-46ba-b1ba-98b4601c0540",
      "image": "assets/images/funk/f12.png",
      "ratingRate": 4.2,
      "ratingCount": 290
    },
    {
      "title": "Vintage Poster Tee",
      "price": 17.99,
      "description": "Showcase your love for vintage rock posters with this detailed graphic tee. The dark navy fabric provides the perfect canvas for the intricate, colorful artwork, making it a standout piece for any music lover's wardrobe. It's soft, comfortable, and full of character.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a1.png",
      "ratingRate": 4.1,
      "ratingCount": 310
    },
    {
      "title": "Album Art Tee",
      "price": 29.5,
      "description": "Dive into a world of fantasy with this incredible graphic tee. The beige shirt features a sprawling, detailed illustration reminiscent of classic fantasy art and rock album covers. A true conversation starter for those who appreciate unique designs.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a2.png",
      "ratingRate": 4.3,
      "ratingCount": 255
    },
    {
      "title": "Palm Tree Rock",
      "price": 17.95,
      "description": "Rock out in paradise with this unique tee. Combining classic rock imagery with tropical palm trees, this shirt offers a fresh, unexpected twist. The deep teal color makes the vibrant graphic pop, perfect for concerts or beach bonfires.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a3.png",
      "ratingRate": 4.9,
      "ratingCount": 188
    },
    {
      "title": "Aqua Skull Tee",
      "price": 28.99,
      "description": "Make an exit as memorable as your entrance. This light aqua tee features a bold skull and bones graphic on the back, perfect for those who prefer a more subtle statement from the front. The soft cotton and relaxed fit ensure all-day comfort.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a4.png",
      "ratingRate": 4.7,
      "ratingCount": 220
    },
    {
      "title": "Winged Rocker",
      "price": 16.5,
      "description": "Unleash your inner rock angel with this epic graphic t-shirt. Featuring a powerful central figure with wings, surrounded by a collage of edgy designs, this navy tee is a masterpiece of alternative style. It's perfect for making a bold statement.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a5.png",
      "ratingRate": 4.2,
      "ratingCount": 442
    },
    {
      "title": "Mystic Folk Tee",
      "price": 29,
      "description": "Embrace a darker, more mystical vibe with this intriguing graphic tee. The design, centered on a haunting figure, evokes a sense of folk horror and alternative rock lore. Printed on a classic navy shirt, it's both stylish and enigmatic.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a6.png",
      "ratingRate": 4.8,
      "ratingCount": 195
    },
    {
      "title": "Cosmic Hero Tee",
      "price": 18.99,
      "description": "Travel to another dimension with this eye-catching t-shirt. The stunning pink-to-blue gradient is the perfect backdrop for a retro sci-fi comic book scene, complete with a guitar-wielding hero. A vibrant and unique addition to any collection.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a7.png",
      "ratingRate": 4.2,
      "ratingCount": 350
    },
    {
      "title": "Art Pop Tee",
      "price": 14.5,
      "description": "Stand out from the crowd in this wildly colorful and imaginative tee. The design is a chaotic, beautiful explosion of pop art and psychedelic imagery, printed on a cool slate blue fabric. It's a wearable piece of art for the bold and adventurous.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a8.png",
      "ratingRate": 4.8,
      "ratingCount": 280
    },
    {
      "title": "Green Panel Tee",
      "price": 27.95,
      "description": "A cool and refreshing take on alternative style. This mint green tee features a vertical panel graphic, filled with a collage of eclectic characters and a prominent skull. The unique layout and color make it a modern classic.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a9.png",
      "ratingRate": 4.6,
      "ratingCount": 175
    },
    {
      "title": "Spider Skull Tee",
      "price": 19.5,
      "description": "Face your fears in style with this intense graphic tee. A formidable warrior skull, entangled with a giant spider, takes center stage on this dark navy shirt. It's a powerful and detailed design for fans of dark fantasy and metal aesthetics.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a10.png",
      "ratingRate": 4.3,
      "ratingCount": 310
    },
    {
      "title": "Spray-Paint Band",
      "price": 26.99,
      "description": "Capture the timeless look of a classic rock band with this effortlessly cool t-shirt. Featuring a black-and-white photo of a three-piece band against a colorful, spray-painted background, this black tee is an essential for any rock fan's wardrobe.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a11.png",
      "ratingRate": 4.5,
      "ratingCount": 389
    },
    {
      "title": "Color Splash Trio",
      "price": 25.99,
      "description": "A slightly different angle on a classic. This black tee showcases a cool rock trio with a vibrant, colorful splash effect. It has a vintage feel with a modern edge, perfect for concerts, casual outings, or just showing off your great taste in music.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a12.png",
      "ratingRate": 4.2,
      "ratingCount": 421
    },
    {
      "title": "Festival Rock Tee",
      "price": 21.95,
      "description": "Combine the best of two worlds with this tie-dye rock tee. The vibrant purple, orange, and blue tie-dye pattern provides a psychedelic backdrop for a classic black-and-white band graphic. Featuring a contrasting black ringer collar, this shirt is pure festival energy.",
      "categoryId": "c8d162cb-b7eb-40c7-9ccd-eca510aa362b",
      "image": "assets/images/alternative/a13.png",
      "ratingRate": 4.3,
      "ratingCount": 398
    }
  ]
